[
    {
        "_id": "enrich2024doh",
        "title": "TTMR++: Enriching Music Descriptions with a Finetuned-LLM and Metadata",
        "decs": "this paper proposes an improved Text-to-Music Retrieval model, denoted as TTMR++, which utilizes rich text descriptions generated with a finetuned large language model and metadata.",
        "category": "research",
        "url": "https://seungheondoh.github.io/text-music-representation-demo-pp/",
        "year" : "2024"
    },{
        "_id": "lp2023doh",
        "title": "LP-MusicCaps: LLM-Based Pseudo Music Captioning",
        "decs": "We propose the use of large language models (LLMs) to artificially generate the description sentences from large-scale tag datasets. This results in approximately 2.2M captions paired with 0.5M audio clips. We trained a transformer-based music captioning model.",
        "category": "research",
        "url": "https://github.com/seungheondoh/lp-music-caps/",
        "year" : "2023"
    },{
        "_id": "toward2023doh",
        "title": "Toward Universal Text-to-Music Retrieval",
        "decs": "This paper introduces effective design choices for text-to-music retrieval systems. An ideal text-based retrieval system would support various input queries such as pre-defined tags, unseen tags, and sentence-level descriptions.",
        "category": "research",
        "url": "https://seungheondoh.github.io/text-music-representation-demo/",
        "year" : "2023"
    },{
        "_id": "speech2023doh",
        "title": "Speech to Music through Emotion",
        "decs": "Automatic speech emotion recognition (SER) can be used as a music recommendation application for content creators. In this paper, our goal is to help creators find music to match the emotion of their speech.",
        "category": "research",
        "url": "https://seungheondoh.github.io/speech-to-music-demo/",
        "year" : "2023"
    },{
        "_id": "musical_word_embedding",
        "title": "Musical Word Embedding for Music Annotation and Retrieval",
        "decs": "Musical Word Embedding use a wide spectrum of text corpus from general to music-specific words and defining musical specificity of the corpus as a measure of how the semantics of words is specific to the songs or far from it.",
        "category": "research",
        "url": "https://seungheondoh.github.io/musical_word_embedding_demo/",
        "year" : "2022"
    }
]